{
  "words": [
    {
      "word": "curriculum",
      "chinese": "课程",
      "story_en": "The curriculum is the core knowledge system of the Magic Academy, jointly compiled by generations of great magicians. It is said that the first version of the curriculum contained over a thousand spell elements (curriculum), each corresponding to a unique magical skill. By studying the curriculum, Gita gradually learned how to use these spell elements to construct complex magic circles.",
      "story_cn": "Curriculum是魔法学院的核心知识体系,由历代大魔法师共同编纂而成。据说,第一版课程表包含了一千多个咒元,每个咒元都对应一种独特的魔法技能。姬塔通过学习Curriculum,逐渐掌握了如何用咒元构建复杂的魔法阵。",
      "sentences": [
        "The curriculum at the Magic Academy teaches students how to master powerful spells like \"fire\" and \"water.\""
      ]
    },
    {
      "word": "pedagogy",
      "chinese": "教学法",
      "story_en": "Pedagogy is a discipline that mentors have studied for years, focusing on how to effectively impart magical knowledge. Gita's mentor, Goolen, is particularly skilled in this method. She adjusts the teaching content based on Gita's learning progress, gradually transitioning from basic spell elements to advanced ones.",
      "story_cn": "Pedagogy是导师们研究多年的学问,专注于如何更高效地传授魔法知识。姬塔的导师古兰特别擅长这种方法,她会根据姬塔的学习进度调整教学内容,例如从基础咒元逐步过渡到高级咒元。",
      "sentences": [
        "Goolen's pedagogy focuses on helping students like Gita understand the true power of words."
      ]
    },
    {
      "word": "epitome",
      "chinese": "摘要",
      "story_en": "An epitome is a concise summary of complex spell elements, often used to distill the essence of a book or article. In the library, Gita discovered an ancient spell element abstract that recorded many powerful combinations of spell elements. By reading the abstract, Gita quickly grasped the key points of certain chapters and successfully solved problems that had been troubling her.",
      "story_cn": "Epitome是对复杂咒元的高度概括,通常用于总结一本书或一篇文章的核心内容。姬塔在图书馆中发现了一本古老的咒元摘要,里面记录了许多强大的咒元组合方式。通过阅读摘要,姬塔快速掌握了某些章节的关键知识点,并成功解决了困扰她的难题。",
      "sentences": [
        "The epitome of the spellbook revealed the secrets of combining \"light\" and \"dark\" to create balance."
      ]
    },
    {
      "word": "orthography",
      "chinese": "正字法",
      "story_en": "Orthography refers to the rules that must be followed when spelling spell elements. At first, Gita often experienced failed spells due to incorrect spellings, but with the help of her mentor, she gradually mastered the correct spelling methods. To help other students, Gita designed a series of fun games, such as \"Letter Maze\" and \"Spell Chain.\" These games were both entertaining and practical, making them very popular among her classmates.",
      "story_cn": "Orthography是拼写咒元时必须遵循的规则。姬塔最初经常因为拼写错误而导致魔法失效,但在导师的帮助下,她逐渐掌握了正确的拼写方法。为了帮助其他学生,姬塔设计了一系列小游戏,例如“字母迷宫”和“咒元接龙”。这些游戏既有趣又实用,深受同学们喜爱。",
      "sentences": [
        "Proper orthography ensures that spells like \"bridge\" and \"tree\" work as intended."
      ]
    },
    {
      "word": "discourse",
      "chinese": "论述",
      "story_en": "Discourse is a special form of magic that requires players to construct coherent sentences using spell elements to solve problems. For instance, during one task, Gita had to fill in the blanks with the correct spell elements to complete an article about forest ecology, which awakened the dormant word spirits. This form not only tests spell memory but also sharpens logical thinking.",
      "story_cn": "Discourse是一种特殊的魔法形式,要求玩家用咒元构建连贯的句子来解决问题。例如,在一次任务中,姬塔必须用正确的咒元填空,完成一篇关于森林生态的文章,才能唤醒沉睡的语灵。这种形式不仅考验咒元记忆,还锻炼逻辑思维。",
      "sentences": [
        "Gita's discourse on forest ecosystems used the spell elements \"tree,\" \"river,\" and \"nature\" to awaken the spirit of the woods."
      ]
    },
    {
      "word": "erudition",
      "chinese": "博学",
      "story_en": "Erudition is the goal pursued by every magician. Through continuous learning of new spell elements, Gita gradually became one of the most learned students in the Magic Academy. Once, she stumbled upon an ancient book in the library that recorded many advanced spell elements, containing much astonishing knowledge. By mastering these spell elements, Gita successfully resolved a major crisis facing the academy.",
      "story_cn": "Erudition是每一位魔法师追求的目标。姬塔通过不断学习新的咒元,逐渐成为魔法学院中最博学的学生之一。有一次,她在图书馆中偶然发现了一本记载着高级咒元的古籍,里面包含了许多令人惊叹的知识。通过掌握这些咒元,姬塔成功解决了学院面临的一场重大危机。",
      "sentences": [
        "Gita's erudition in spell elements allowed her to solve the mystery of the lost Word Spirits."
      ]
    }
  ]
}